IDENTIFICATION DIVISION.
	PROGRAM-ID. ACCOUNT-TYPE.
	AUTHOR. KRITHIKA-M.

ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SOURCE-COMPUTER. IBM-3278.
	OBJECT-COMPUTER. IBM-3278.

DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 T PIC X(1).


PROCEDURE DIVISION.
	DISPLAY "ENTER THE ACCOUNT TYPE (S/C):  ".
	ACCEPT T.

	IF T = 'S'
  		DISPLAY "SAVINGS ACCOUNT"
	ELSE
  		DISPLAY "CURRENT ACCOUNT"

STOP RUN.
