IDENTIFICATION DIVISION.
	PROGRAM-ID. ACCSTATUS.
	AUTHOR. KRITHIKA-M.

ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SOURCE-COMPUTER. IBM-3278.
	OBJECT-COMPUTER. IBM-3278.

DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 ACCOUNT-STATUS      PIC X.
  	88 ACTIVE-STATUS    VALUE 'A'.
  	88 INACTIVE-STATUS  VALUE 'I'.

PROCEDURE DIVISION.
	DISPLAY "ENTER ACCOUNT STATUS (A/I): ".
	ACCEPT ACCOUNT-STATUS.
	IF ACTIVE-STATUS
        	DISPLAY "ACCOUNT ACTIVE"
        ELSE IF INACTIVE-STATUS
             	DISPLAY "ACCOUNT INACTIVE"
        ELSE
             	DISPLAY "INVALID STATUS"
   	END-IF.
STOP RUN.
