IDENTIFICATION DIVISION.
  PROGRAM-ID. BUBBLE-SORT.
  AUTHOR. KRITHIKA-M.

DATA DIVISION.
  WORKING-STORAGE SECTION.
  01 A OCCURS 5 TIMES PIC 9(2).
  01 I PIC 9.
  01 J PIC 9.
  01 TEMP PIC 9(2).

PROCEDURE DIVISION.
  PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
    ACCEPT A(I)
  END-PERFORM.

  PERFORM VARYING I FROM 1 BY 1 UNTIL I > 4
    PERFORM VARYING J FROM I BY 1 UNTIL J > 5
      IF A(I) > A(J)
        MOVE A(I) TO TEMP
        MOVE A(J) TO A(I)
        MOVE TEMP TO A(J)
      END-IF
    END-PERFORM
  END-PERFORM.

  PERFORM VARYING I FROM 1 BY 1 UNTIL I > 5
    DISPLAY A(I)
  END-PERFORM.

STOP RUN.
