IDENTIFICATION DIVISION. 
  PROGRAM-ID. CELSIUS-TO-FAHRENHEIT. 
  AUTHOR. KRITHIKA-M. 

ENVIRONMENT DIVISION. 
  CONFIGURATION SECTION. 
  SOURCE-COMPUTER. IBM-3278. 
  OBJECT-COMPUTER. IBM-3278.

DATA DIVISION. 
  WORKING-STORAGE SECTION. 
  01 FAHRENHEIT PIC 9(2). 
  01 CELSIUS PIC 9(2). 
  01 TEMP PIC 9(2). 

PROCEDURE DIVISION. 
  DISPLAY "PROVIDE THE TEMPERATURE IN CELSIUS". 
  ACCEPT CELSIUS. 
  COMPUTE TEMP = CELSIUS*9/5. 
  COMPUTE FAHRENHEIT = TEMP + 32 . 
  DISPLAY "THE TEMPERATURE IN FAHRENHEIT IS: " FAHRENHEIT.
STOP RUN.
