IDENTIFICATION DIVISION.
  PROGRAM-ID. COMPOUND-INTEREST.
  AUTHOR. KRITHIKA-M.

DATA DIVISION.
  WORKING-STORAGE SECTION.
  01 P   PIC 9(5).
  01 R   PIC 9(2)V9(2).
  01 T   PIC 9(2).
  01 CI  PIC 9(9)V9(2).

PROCEDURE DIVISION.
  DISPLAY "ENTER PRINCIPAL: ".
  ACCEPT P.
  DISPLAY "ENTER RATE: ".
  ACCEPT R.
  DISPLAY "ENTER TIME (YEARS): ".
  ACCEPT T.
  COMPUTE CI = P * ((1 + R / 100) ** T).
  DISPLAY "COMPOUND INTEREST IS: " CI.

STOP RUN.
