IDENTIFICATION DIVISION.
  PROGRAM-ID. CONCATENATE.
  AUTHOR. KRITHIKA-M.

DATA DIVISION.
  WORKING-STORAGE SECTION.
  01 S1 PIC X(20).
  01 S2 PIC X(20).
  01 S3 PIC X(40).
  01 LEN PIC 9(3).

PROCEDURE DIVISION.
  ACCEPT S1.
  ACCEPT S2.

  STRING S1 DELIMITED BY SPACE
         S2 DELIMITED BY SPACE
         INTO S3.

  COMPUTE LEN = FUNCTION LENGTH(FUNCTION TRIM(S3)).

  DISPLAY S3.
  DISPLAY LEN.
STOP RUN.
