IDENTIFICATION DIVISION.
PROGRAM-ID. AGE-ELIGIBILITY.
AUTHOR. KRITHIKA-M.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-3278.
OBJECT-COMPUTER. IBM-3278.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 AGE               PIC  9(2).
01 MIN-AGE      PIC  9(2) VALUE 18.

PROCEDURE DIVISION.
DISPLAY "ENTER YOUR AGE: ".
ACCEPT AGE.

IF AGE >= MIN-AGE
   DISPLAY "CUSTOMER IS ELIGIBLE"
ELSE
   DISPLAY "CUSTOMER IS NOT ELIGIBLE"
END-IF.

STOP RUN.
