IDENTIFICATION DIVISION.
PROGRAM-ID. DEPOSIT-TRANSACTION.
AUTHOR. KRITHIKA-M.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-3278.
OBJECT-COMPUTER. IBM-3278.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 BALANCE    PIC 9(4).
01 DEPOSIT    PIC 9(4).
01 UPDATED    PIC 9(4).

PROCEDURE DIVISION.
DISPLAY "ENTER YOUR BALANCE: ".
ACCEPT BALANCE.
DISPLAY "ENTER YOUR DEPOSIT: ".
ACCEPT DEPOSIT.
COMPUTE UPDATED = BALANCE + DEPOSIT.
DISPLAY "UPDATED BALANCE: " UPDATED.

STOP RUN.
