IDENTIFICATION DIVISION.
  PROGRAM-ID. FACTORIAL.
  AUTHOR. KRITHIKA.

ENVIRONMENT DIVISION.
  CONFIGURATION SECTION.
  SOURCE-COMPUTER. IBM-3278.
  OBJECT-COMPUTER. IBM-3278.

DATA DIVISION.
  WORKING-STORAGE SECTION.
  01 NUM PIC 9(2).
  01 A PIC 9(3) VALUE 1.
PROCEDURE DIVISION.
  DISPLAY "ENTER A NUMBER:".
  ACCEPT NUM.
  DISPLAY "THE GIVEN NUMBER IS: " NUM.
  IF NUM=0 OR NUM=1
    DISPLAY "FACTORIAL IS 1"
  ELSE 
    PERFORM FACTORIAL
    DISPLAY "FACTORIAL OF THE NUMBER IS " A
  END-IF.
  STOP RUN.
FACTORIAL.
  IF NUM>1
    MULTIPLY NUM BY A
    SUBTRACT 1 FROM NUM
    PERFORM FACTORIAL
  END-IF.
