IDENTIFICATION DIVISION.
  PROGRAM-ID. LARGE-NUM.
  AUTHOR. KRITHIKA-M.

DATA DIVISION.
  WORKING-STORAGE SECTION.
  01 A PIC 9(3).
  01 B PIC 9(3).
  01 C PIC 9(3).

PROCEDURE DIVISION.
  ACCEPT A.
  ACCEPT B.
  ACCEPT C.

  IF A > B AND A > C
    DISPLAY "LARGE-NUM IS: " A
  ELSE IF B > C
    DISPLAY "LARGE-NUM IS: " B
  ELSE
    DISPLAY "LARGE-NUM IS: " C
  END-IF.

STOP RUN.
