IDENTIFICATION DIVISION.
	PROGRAM-ID. MENU-CHOICE.
	AUTHOR. KRITHIKA-M.

ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SOURCE-COMPUTER. IBM-3278.
	OBJECT-COMPUTER. IBM-3278.

DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 CHOICE PIC 9(1).


PROCEDURE DIVISION.
 	DISPLAY "----- MENU -----".
    	DISPLAY "1. DEPOSIT".
    	DISPLAY "2. WITHDRAW".
    	DISPLAY "3. BALANCE".
    	DISPLAY "ENTER YOUR CHOICE: ".
    	ACCEPT CHOICE.
 	EVALUATE CHOICE
    		WHEN 1
      			DISPLAY "DEPOSIT SELECTED"
    		WHEN 2
      			DISPLAY "WITHDRAWAL SELECTED"
    		WHEN 3
      			DISPLAY "BALANCE DISPLAYED"
STOP RUN.
