IDENTIFICATION DIVISION.
PROGRAM-ID. MIN-BALANCE.
AUTHOR. KRITHIKA-M.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-3278.
OBJECT-COMPUTER. IBM-3278.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 ACC-BALANCE    PIC 9(5).
01 MIN-BALANCE      PIC 9(5) VALUE 1000.

PROCEDURE DIVISION.
DISPLAY "ENTER YOUR BALANCE: ".
ACCEPT ACC-BALANCE.

IF ACC-BALANCE >= MIN-BALANCE
   DISPLAY "MINIMUM BALANCE MAINTAINED"
ELSE
   DISPLAY "MINIMUM BALANCE NOT MAINTAINED"
END-IF.

STOP RUN.
