IDENTIFICATION DIVISION.
PROGRAM-ID. PIN-VERIFICATION.
AUTHOR. KRITHIKA-M.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
SOURCE-COMPUTER. IBM-3278.
OBJECT-COMPUTER. IBM-3278.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 USER-PIN    PIC 9(5).
01 VALID-PIN   PIC 9(4) VALUE 1234.

PROCEDURE DIVISION.
DISPLAY "ENTER YOUR PIN: ".
ACCEPT USER-PIN.

IF USER-PIN = VALID-PIN
   DISPLAY "ACCESS GRANTED"
ELSE
   DISPLAY "ACCESS DENIED"
END-IF.

STOP RUN.
