IDENTIFICATION DIVISION.
  PROGRAM-ID. PRIME.
  AUTHOR. KRITHIKA-M.

DATA DIVISION.
  WORKING-STORAGE SECTION.
  01 N        PIC 9(3).
  01 I        PIC 9(3).
  01 IS-PRIME PIC X VALUE 'Y'.

PROCEDURE DIVISION.
    PERFORM VARYING N FROM 2 BY 1 UNTIL N > 200
        MOVE 'Y' TO IS-PRIME
        PERFORM VARYING I FROM 2 BY 1 UNTIL I >= N
            IF FUNCTION MOD(N, I) = 0
                MOVE 'N' TO IS-PRIME
                EXIT PERFORM
            END-IF
        END-PERFORM
        IF IS-PRIME = 'Y'
            DISPLAY N
        END-IF
    END-PERFORM
STOP RUN.
