IDENTIFICATION DIVISION.
  PROGRAM-ID. PRINT100.
  AUTHOR. KRITHIKA-M.

DATA DIVISION.
  WORKING-STORAGE SECTION.
  01 I PIC 9(3).

PROCEDURE DIVISION.
  PERFORM VARYING I FROM 1 BY 1 UNTIL I > 100
    DISPLAY I
  END-PERFORM.
STOP RUN.
