IDENTIFICATION DIVISION.
  PROGRAM-ID. DIVI2-3-17.
  AUTHOR. KRITHIKA-M.

DATA DIVISION.
  WORKING-STORAGE SECTION.
  01 N PIC 9(4).

PROCEDURE DIVISION.
  PERFORM VARYING N FROM 1 BY 1 UNTIL N > 1000
    IF FUNCTION MOD(N 2) = 0
      AND FUNCTION MOD(N 3) = 0
      AND FUNCTION MOD(N 17) = 0
          DISPLAY N
    END-IF
  END-PERFORM.

STOP RUN.
