IDENTIFICATION DIVISION.
  PROGRAM-ID. REVERSE-5.
  AUTHOR. KRITHIKA-M.

DATA DIVISION.
  WORKING-STORAGE SECTION.
  01 NUM PIC 9(5).
  01 REV PIC 9(5) VALUE 0.

PROCEDURE DIVISION.
  DISPLAY "ENTER AN 5 DIGIT NUMBER: "
  ACCEPT NUM.

PERFORM UNTIL NUM = 0
    COMPUTE REV = REV * 10 + FUNCTION MOD(NUM 10)
    COMPUTE NUM = NUM / 10
END-PERFORM.

DISPLAY REV.
STOP RUN.
