IDENTIFICATION DIVISION.
	PROGRAM-ID. SIMPLE-INTEREST.
	AUTHOR. KRITHIKA-M.

ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SOURCE-COMPUTER. IBM-3278.
	OBJECT-COMPUTER. IBM-3278.

DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 P    PIC 9(5).
	01 R  PIC 9(2).
	01 T PIC 9(2).
	01 SI PIC 9(3).

PROCEDURE DIVISION.
	DISPLAY "ENTER PRINCIPLE: ".
	ACCEPT P.
	DISPLAY "ENTER RATE: ".
	ACCEPT R.
	DISPLAY "ENTER TIME: ".
	ACCEPT T.

	COMPUTE SI = (P * R * T) / 100.
	DISPLAY "SIMPLE-INTEREST IS : " SI.

STOP RUN.
