IDENTIFICATION DIVISION.
  PROGRAM-ID. SUM20.
  AUTHOR. KRITHIKA-M.

DATA DIVISION.
  WORKING-STORAGE SECTION.
  01 NUM-ARRAY.
    05 NUM OCCURS 20 TIMES PIC 9(3).
  01 A        PIC 9(2).
  01 TOTAL    PIC 9(6) VALUE 0.

PROCEDURE DIVISION.
  PERFORM VARYING A FROM 1 BY 1 UNTIL A > 20
    ACCEPT NUM(A)
    ADD NUM(A) TO TOTAL
  END-PERFORM

  DISPLAY "Sum = " TOTAL
STOP RUN.
