IDENTIFICATION DIVISION.
	PROGRAM-ID. WITHDRAWAL-TRANSACTION.
	AUTHOR. KRITHIKA-M.

ENVIRONMENT DIVISION.
	CONFIGURATION SECTION.
	SOURCE-COMPUTER. IBM-3278.
	OBJECT-COMPUTER. IBM-3278.

DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 BALANCE     PIC 9(5).
	01 WITHDRAWAL  PIC 9(5).

PROCEDURE DIVISION.
	DISPLAY "ENTER YOUR BALANCE: ".
	ACCEPT BALANCE.
	DISPLAY "ENTER YOUR WITHDRAWAL AMOUNT: ".
	ACCEPT WITHDRAWAL.

	IF BALANCE >= WITHDRAWAL
	   DISPLAY "WITHDRAWAL SUCCESSFUL"
	ELSE
	   DISPLAY "INSUFFICIENT BALANCE"
	END-IF.
